movidat/app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("cast", "created_at", "description", "genre", "length", "title", "updated_at", "url", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "cast" = ?, "genre" = ?, "updated_at" = ? WHERE "movies"."id" = 4  [["cast", " William Powell, Myrna Loy, Barry Nelson"], ["genre", "Comedy, Romance, Drama "], ["updated_at", "2016-03-17 17:27:13.497341"]]